
GetPassphraseDescription = "You need a passphrase to unlock the secret key for user: \"%@\", ID %@";
GetPassphraseDescription_Subkey = "You need a passphrase to unlock the secret key for user: \"%@\", ID %@, (main key ID %@)";
PassphraseLabel = "Passphrase:";



//Für den Schlüssel-Status
"Invalid" = "Ungültig";
"Revoked" = "Widerrufen";
"Expired" = "Abgelaufen";
"Disabled" = "Deaktiviert";
"Unknown" = "Unbekannt";
"Marginal" = "Marginal";
"Full" = "Vollständig";
"Ultimate" = "Absolut";


//Für Widerrufen und Wiederholen
Undo_NewKey = "Schlüssel erstellen";
Undo_Delete = "Löschen";
Undo_CleanKey = "Säubern";
Undo_MinimizeKey = "Minimieren";
Undo_RevokeKey = "Schlüssel widerrufen";
Undo_ChangeExpirationDate = "Verfallsdatum ändern";
Undo_ChangePassphrase = "Passphrase ändern";
Undo_AlgorithmPreferences = "Bevorzugten Algorithmus ändern";
Undo_Import = "Importieren";
Undo_AddSignature = "Beglaubigen";
Undo_RemoveSignature = "Beglaubigung entfernen";
Undo_RevokeSignature = "Beglaubigung widerrufen";
Undo_AddSubkey = "Unterschlüssel hinzufügen";
Undo_RemoveSubkey = "Unterschlüssel entfernen";
Undo_RevokeSubkey = "Unterschlüssel widerrufen";
Undo_AddUserID = "Benutzer-ID hinzufügen";
Undo_RemoveUserID = "Benutzer-ID entfernen";
Undo_RevokeUserID = "Benutzer-ID widerrufen";
Undo_PrimaryUserID = "Primäre Benutzer-ID";
Undo_AddPhoto = "Foto hinzufügen";
Undo_RefreshFromServer = " Von Server aktualisieren";
Undo_ReceiveFromServer = "Von Server abfragen";



//Algorithm names
CIPHER_ALGO_NONE = "None";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "None";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_EllipticCurveAlgorithm = "EllipticCurve";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
